# utils/messages.py

WELCOME_MESSAGE = """
مرحبًا بك في خدمة حجز المواعيد لدى الدكتور.
يمكنك البدء بطلب حجز جديد من خلال الزر التالي.
"""

ASK_NAME = "يرجى إدخال اسمك الثلاثي."

ASK_GENDER = "يرجى اختيار الجنس:"

ASK_PHONE_METHOD = "يرجى اختيار طريقة إدخال رقم الهاتف:"

ASK_PHONE_INPUT = "يرجى إدخال رقم هاتفك."

ASK_NOTES = (
    "هل لديك أي ملاحظات أو سبب للزيارة؟ (اختياري)\n"
    "يمكنك كتابة الملاحظة أو إرسال كلمة 'لا' للمتابعة."
)
ASK_CITY_PROVINCE = "يرجى اختيار المحافظة:"

ASK_CITY_INPUT = "يرجى إدخال اسم المدينة أو المنطقة التي تقيم فيها."

SUCCESS_MESSAGE = "تم استلام طلبك بنجاح.\n" "سيتم التواصل معك عند مراجعة الطلب."

CANCEL_MESSAGE = "تم إلغاء عملية الحجز."

CONFIRM_HEADER = "يرجى تأكيد المعلومات التالية:\n\n"
